# Basic SQL

## Pre-requisition

In [7]:
import pandas as pd
import sqlite3

In [9]:
conn = sqlite3.connect("dvd_rental/sqlite-sakila.db")

## SELECT

Select is used for retrieve data from one or more tables.

**Example**

> SELECT column_name FROM table_name

### All data using *

In [21]:
query = "SELECT * from actor"

df = pd.read_sql_query(query, conn)
df.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2021-03-06 15:51:59
1         2       NICK      WAHLBERG  2021-03-06 15:51:59
2         3         ED         CHASE  2021-03-06 15:51:59
3         4   JENNIFER         DAVIS  2021-03-06 15:51:59
4         5     JOHNNY  LOLLOBRIGIDA  2021-03-06 15:51:59

### Specific data

In [ ]:

query = "SELECT first_name, last_name FROM actor"
df = pd.read_sql_query(query, conn)
df.head()

  first_name     last_name
0   PENELOPE       GUINESS
1       NICK      WAHLBERG
2         ED         CHASE
3   JENNIFER         DAVIS
4     JOHNNY  LOLLOBRIGIDA